In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql
pragma foreign_keys = ON

 * sqlite://
Done.

[]

# Задание 1 

Рассмотрим 2 таблицы

A

|   name  |  key   | value
|---------|--------- | ----
| Ivanov  |   FIO  |  Иванов Иван Иванович
| Ivanov  | Phone  |  +(7) 111-1111111
| Ivanov  | email  | ivanov@ivanov.com
| Petrov  |   FIO  | Петров Петр Петрович
| Petrov  | Phone  |  +(7) 222-2222222
| Petrov  | email  | petrov@petrov.com

B

|   name  |  FIO   | Phone | email
|---------|---------|------|---
| Ivanov  | Иванов Иван Иванович | +(7) 111-1111111 | ivanov@ivanov.com
| Petrov  | Петров Петр Петрович | +(7) 222-2222222 | petrov@petrov.com


1. Как из таблицы A получить B?
2. Как из таблицы B получить A?

### <span style="color:#FF9200">Создаем таблицу А</span>

In [3]:
%%sql
DROP TABLE IF EXISTS A;
CREATE TABLE A (
    name VARCHAR(30),
    key VARCHAR(30),
    value VARCHAR(30)
);

 * sqlite://
Done.
Done.

[]

### <span style="color:#FF9200">Добавляем в нее значения из примера</span>

In [4]:
%%sql
INSERT INTO A VALUES ('Ivanov', 'FIO', 'Иванов Иван Иванович');
INSERT INTO A VALUES ('Ivanov', 'Phone', '+(7) 111-1111111');
INSERT INTO A VALUES ('Ivanov', 'email', 'ivanov@ivanov.com');
INSERT INTO A VALUES ('Petrov', 'FIO', 'Петров Петр Петрович');
INSERT INTO A VALUES ('Petrov', 'Phone', '+(7) 222-2222222');
INSERT INTO A VALUES ('Petrov', 'email', 'petrov@petrov.com');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### <span style="color:#FF9200">Из А получаем B</span>

In [5]:
%%sql
SELECT name, MAX(CASE WHEN KEY = 'FIO' THEN VALUE END) AS FIO, 
       MAX(CASE WHEN KEY = 'Phone' THEN VALUE END) AS Phone, 
        MAX(CASE WHEN KEY = 'email' THEN VALUE END) AS email
FROM A
GROUP BY name

 * sqlite://
Done.

[('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111', 'ivanov@ivanov.com'),
 ('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com')]

### <span style="color:#FF9200">Создаем таблицу В</span>

In [6]:
%%sql
DROP TABLE IF EXISTS B;
CREATE TABLE B (
    name VARCHAR(30),
    FIO VARCHAR(30),
    Phone VARCHAR(30),
    email VARCHAR(30)
);

 * sqlite://
Done.
Done.

[]

### <span style="color:#FF9200">Добавляем в нее значения из примера</span>

In [7]:
%%sql
INSERT INTO B VALUES('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111', 'ivanov@ivanov.com');
INSERT INTO B VALUES('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com');

 * sqlite://
1 rows affected.
1 rows affected.

[]

### <span style="color:#FF9200">Из B получаем A</span>

In [8]:
%%sql
SELECT name, 'FIO' KEY, FIO value 
FROM B
UNION
SELECT name, 'Phone' KEY, Phone value
FROM B
UNION
SELECT name, 'email' KEY, email value
FROM B

 * sqlite://
Done.

[('Ivanov', 'FIO', 'Иванов Иван Иванович'),
 ('Ivanov', 'Phone', '+(7) 111-1111111'),
 ('Ivanov', 'email', 'ivanov@ivanov.com'),
 ('Petrov', 'FIO', 'Петров Петр Петрович'),
 ('Petrov', 'Phone', '+(7) 222-2222222'),
 ('Petrov', 'email', 'petrov@petrov.com')]

# Задание 2
Рассмотрим таблицу StudentMarks

| student_name | mark_date | mark_value
|---------|--------- | ----
| Ivanov  | 2019.01.01 | 3
| Ivanov  | 2019.01.05 | 4
| Ivanov  | 2019.02.03 | 5
| Petrov  | 2019.02.01 | 2
| Petrov  | 2019.02.16 | 4
| Petrov  | 2019.04.17 | 5

В данной таблице студенту проставляется оценка за определенную дату. Необходимо сформировать интервалы, 
за время которых оценка не менялась,
и среднюю оценку, находящуюся в данном интервале.
Текущий интервал должен заканчиваться на 5999.12.31


По исходным данным результатом таблицы будет следущее:

| client_name | mark_validfrom | mark_validto | average_mark_value
|---------|--------- | ------ | -----
| Ivanov  | 2019.01.01 | 2019.01.04 | 3
| Ivanov  | 2019.01.05 | 2019.02.02 | 3.5
| Ivanov  | 2019.02.03 | 5999.12.31 | 4
| Petrov  | 2019.02.01 | 2019.02.15 | 2
| Petrov  | 2019.02.16 | 2019.04.16 | 3
| Petrov  | 2019.04.17 | 5999.12.31 | 3.6666

### <span style="color:#FF9200">Создаем таблицу StudentMarks</span>

In [9]:
%%sql
DROP TABLE IF EXISTS StudentMarks;
CREATE TABLE StudentMarks (
    student_name VARCHAR(30),
    mark_date DATE,
    mark_value INTEGER
);

 * sqlite://
Done.
Done.

[]

### <span style="color:#FF9200">Добавляем в нее значения из примера</span>

In [10]:
%%sql
INSERT INTO StudentMarks VALUES ('Ivanov', '2019-01-01', 3);
INSERT INTO StudentMarks VALUES ('Ivanov', '2019-01-05', 4);
INSERT INTO StudentMarks VALUES ('Ivanov', '2019-02-03', 5);
INSERT INTO StudentMarks VALUES ('Petrov', '2019-02-01', 2);
INSERT INTO StudentMarks VALUES ('Petrov', '2019-02-16', 4);
INSERT INTO StudentMarks VALUES ('Petrov', '2019-04-17', 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### <span style="color:#FF9200">Итоговая таблица</span>

In [11]:
%%sql
SELECT student_name AS client_name, mark_date AS mark_validfrom, 
       DATE(LEAD(mark_date, 1, DATE('6000-01-01')) OVER (PARTITION BY student_name ORDER BY mark_date), '-1 day') AS mark_validto,
       ROUND(AVG(mark_value) OVER (PARTITION BY student_name ORDER BY mark_date), 2) AS average_mark_value
FROM StudentMarks

 * sqlite://
Done.

[('Ivanov', '2019-01-01', '2019-01-04', 3.0),
 ('Ivanov', '2019-01-05', '2019-02-02', 3.5),
 ('Ivanov', '2019-02-03', '5999-12-31', 4.0),
 ('Petrov', '2019-02-01', '2019-02-15', 2.0),
 ('Petrov', '2019-02-16', '2019-04-16', 3.0),
 ('Petrov', '2019-04-17', '5999-12-31', 3.67)]

# Задание 3


Рассмотрим таблицу CheatList, описывающую блокнот со шпаргалками. В данной таблице на одном листе может быть только одна шпаргалка по одному предмету. Блокнот состоит из 2N листов, пронумерованных от 0 до 2N-1. 0 лист всегда пустой, 2N-1 лист может быть как пустым, так и заполненным. В самом конце блокнота не может быть 2 подряд пустых листа. Необходимо вернуть таблицу вида (left_list, right_list), описывающую все листы в отсортированном порядке
## Пример 

| ListNumber | Subject 
| -----------|--------
|  1         | Math
|  3         | Math
|  4         | History

## Результат

| left_list | right_list 
| --------- | ---------
|   NULL    |  Math
|   NULL    |  Math
|   History |  NULL

### <span style="color:#FF9200">Создаем таблицу CheatList</span>

In [12]:
%%sql
DROP TABLE IF EXISTS CheatList;
CREATE TABLE CheatList (
    ListNumber integer unique,--primary key not null,
    Subject    
);

 * sqlite://
Done.
Done.

[]

### <span style="color:#FF9200">Добавляем в нее значения из примера</span>

In [13]:
%%sql
INSERT INTO CheatList VALUES (1, 'Math');
INSERT INTO CheatList VALUES (3, 'Math');
INSERT INTO CheatList VALUES (4, 'History');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

### <span style="color:#FF9200">Результат</span>

In [14]:
%%sql
WITH
    tp(amount) AS (
               SELECT MAX(ListNumber) + (1 - MAX(ListNumber) % 2)
               FROM CheatList
             ),
    blank(ID, SUB) AS(
                       SELECT 1, NULL
                       UNION
                       SELECT ID + 1, NULL from blank
                       WHERE ID < (
                                    SELECT amount
                                    FROM tp
                                  )
                     )

SELECT left_list, right_list
FROM (
        SELECT ID, LAG(Subject) OVER () AS left_list, Subject AS right_list
        FROM blank
        LEFT JOIN CheatList ON ID LIKE ListNumber
     )
WHERE id % 2 = 1

 * sqlite://
Done.

[(None, 'Math'), (None, 'Math'), ('History', None)]

# Задание 4
Используя формат xml, описанный в [dbmstools](http://dbmstools.sourceforge.net/docs/xmlschema.html), напишите функцию на языке Python, на входе который будет путь к xml, на выходе - скрипт с DDL скриптами таблиц (можно ограничиться table блоком)

In [15]:
from xml.etree import ElementTree

def parse_xml(xmlFile):
    """Parse the XML file"""
    tree = ElementTree.parse(xmlFile)
    root = tree.getroot()
    
    query = []
    
    db_schema = root.attrib['name']
    tables = root.findall('table')
    
    for table in tables:
        table_name = table.attrib['name']
                
        """Overriding processing"""
        if table[0].tag == 'schema-override':
            query.append('DROP TABLE IF EXISTS {0}.{1};'.format(table[0].attrib['schema'], table_name))
            
        query.append('CREATE TABLE {0}.{1} ('.format(db_schema, table_name))
        
        """Columns processing"""
        columns_start = table.find('columns')
        columns = columns_start.findall('column')

        
        for column in columns:
            q = '\t'
            q += column.attrib['name']
            
            if 'type' in column.attrib:
                q += ' ' + column.attrib['type'].upper()
            if 'length' in column.attrib:
                q += '(' + column.attrib['length']
                if 'scale' in column.attrib:
                    q += ',' + column.attrib['scale']
                q += ')'
            if column.attrib.get('allows-null', 'true') == 'false':
                q += ' NOT NULL'
            if column.attrib.get('auto-increment', 'false') == 'true':
                q += ' AUTO INCREMENT'
            if 'default-value' in column.attrib:
                q += ' DEFAULT ' + column.attrib['default-value']
            if 'constraints' in column.attrib:
                q += ' ' + column.attrib['constraints']
            q += ','
                
            query.append(q)
        
        """Constraint processing"""
        constraints = table.find('constraints')
        
        if constraints:
        
            for constraint in constraints:
                q = '\tCONSTRAINT '
                
                if constraint.tag == 'primary-key':
                    q += 'PK_' + constraint.attrib['name'] + ' PRIMARY KEY ('
                    for name in constraint.iterfind('column-ref'):
                        q += name.attrib['name'] + ', '
                    q = q[:-2] + '), '
                
                if constraint.tag == 'unique':
                    q += 'UN_' + table_name + ' UNIQUE ('
                    for name in constraint.iterfind('column-ref'):
                        q += name.attrib['name'] + ', '
                    q = q[:-2] + '),'
                if constraint.tag == 'foreign-key':
                    q += 'FK_' + constraint.attrib['name'] + ' FOREIGN KEY ('
                    
                    for name in constraint.iterfind('column-ref'):
                        q += name.attrib['name'] + ','
                    q = q[:-1] + ') REFERENCES {0} ('.format(constraint.attrib['references'])
                
                    for name in constraint.iterfind('referenced-column'):
                        q += name.attrib['name'] + ','
                    q = q[:-1] + '),'
                query.append(q)
            
           
            query[-1] = query[-1][:-1] + ');'    
        
        
        """Index processing"""
        indexes = table.find('indexes')
        
        if indexes:                           
            for index in indexes:
                q  = 'CREATE '
                
                if 'unique' in index.attrib and index.attrib['unique'] == 'true':
                    q += 'UNIQUE '
                
                q += 'INDEX {0}\nON {1} ('.format(index.attrib['name'], table_name)

                for column in index:
                    q += column.attrib['name'] + ', '
                    
                q = q[:-2] + ');'       
        
            query.append(q)
    return query            

if __name__ == "__main__":
    f = r'test.xml'
    query = parse_xml(f)
    
    for q in query:
        print(q)

DROP TABLE IF EXISTS Job.Workman;
CREATE TABLE Job.Workman (
	id INT AUTO INCREMENT,
	surname VARCHAR(50) NOT NULL,
	name VARCHAR(50) NOT NULL,
	qualification VARCHAR(50),
	experience INT,
	identification_key VARCHAR(50),
	CONSTRAINT PK_pmk PRIMARY KEY (identification_key),
	CONSTRAINT UN_Workman UNIQUE (identification_key),
	CONSTRAINT FK_fnk FOREIGN KEY (id) REFERENCES Workplace (place_id));
CREATE UNIQUE INDEX ind_id
ON Workman (surname, name);

# Задание 5
Необходимо уметь хранить матрицы MxM внутри СУБД. Предложите способ хранения, и приведите пример перемножения двух матриц средствами SQL

Создадим две таблицы, по одной на каждую матрицу. В каждой будет по 3 столбца: pos_i - позиция элемента по горизонтали, pos_j - по вертикали, value - значение элемента в соответствующей позиции.

In [16]:
%%sql
DROP TABLE IF EXISTS A;
CREATE TABLE A (
     pos_i INTEGER,
     pos_j INTEGER,
     value INTEGER
);

DROP TABLE IF EXISTS B;
CREATE TABLE B (
     pos_i INTEGER,
     pos_j INTEGER,
     value INTEGER
);

insert into A values (1,1,1);
insert into A values (1,2,2);
insert into A values (1,3,3);
insert into A values (2,1,4);
insert into A values (2,2,5);
insert into A values (2,3,6);
insert into A values (3,1,7);
insert into A values (3,2,8);
insert into A values (3,3,9);

insert into B values (1,1,9);
insert into B values (1,2,8);
insert into B values (1,3,7);
insert into B values (2,1,6);
insert into B values (2,2,5);
insert into B values (2,3,4);
insert into B values (3,1,3);
insert into B values (3,2,2);
insert into B values (3,3,1);

 * sqlite://
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
SELECT * FROM A;

 * sqlite://
Done.

[(1, 1, 1),
 (1, 2, 2),
 (1, 3, 3),
 (2, 1, 4),
 (2, 2, 5),
 (2, 3, 6),
 (3, 1, 7),
 (3, 2, 8),
 (3, 3, 9)]

In [18]:
%%sql
SELECT * FROM B;

 * sqlite://
Done.

[(1, 1, 9),
 (1, 2, 8),
 (1, 3, 7),
 (2, 1, 6),
 (2, 2, 5),
 (2, 3, 4),
 (3, 1, 3),
 (3, 2, 2),
 (3, 3, 1)]

In [19]:
%%sql
SELECT A.pos_i, B.pos_j, SUM(A.value*B.value) AS value
FROM A
JOIN B ON A.pos_j = B.pos_i
GROUP BY A.pos_i, B.pos_j
ORDER BY A.pos_i, B.pos_j;

 * sqlite://
Done.

[(1, 1, 30),
 (1, 2, 24),
 (1, 3, 18),
 (2, 1, 84),
 (2, 2, 69),
 (2, 3, 54),
 (3, 1, 138),
 (3, 2, 114),
 (3, 3, 90)]